; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_2 object type_3 type_1)
 (:predicates (pred_2 ?v7 - type_3 ?v6 - type_2)
 	      (pred_3 ?v2 - object ?v6 - type_2)
	      (pred_4 ?v7 - type_3 ?v1 - type_1)
	      (pred_1 ?v7 - type_3 ?v2 - object ?v1 - type_1))

   (:action op_3
       :parameters  (?v7 - type_3 ?v8 ?v4 - type_2)
       :precondition (and  (pred_2 ?v7 ?v8))
       :effect (and  (pred_2 ?v7 ?v4)
		     (not (pred_2 ?v7 ?v8))))

   (:action op_1
       :parameters (?v7 - type_3 ?v3 - object ?v5 - type_2 ?v1 - type_1)
       :precondition  (and  (pred_3 ?v3 ?v5) (pred_2 ?v7 ?v5) (pred_4 ?v7 ?v1))
       :effect (and (pred_1 ?v7 ?v3 ?v1)
		    (not (pred_3 ?v3 ?v5)) 
		    (not (pred_4 ?v7 ?v1))))

   (:action op_2
       :parameters (?v7 - type_3 ?v3 - object ?v5 - type_2 ?v1 - type_1)
       :precondition  (and  (pred_1 ?v7 ?v3 ?v1) (pred_2 ?v7 ?v5))
       :effect (and (pred_3 ?v3 ?v5)
		    (pred_4 ?v7 ?v1)
		    (not (pred_1 ?v7 ?v3 ?v1)))))

; problem
(define (problem gripper-2-3-3)
(:domain gripper-strips)
(:objects obj_10 obj_05 - type_3
obj_11 obj_02 obj_04 obj_09 - type_1
obj_06 obj_03 obj_12 - type_2
obj_01 obj_07 obj_08 - object)
(:init
(pred_2 obj_10 obj_12)
(pred_4 obj_10 obj_11)
(pred_4 obj_10 obj_02)
(pred_2 obj_05 obj_12)
(pred_4 obj_05 obj_04)
(pred_4 obj_05 obj_09)
(pred_3 obj_01 obj_12)
(pred_3 obj_07 obj_03)
(pred_3 obj_08 obj_12)
)
(:goal
(and
(pred_3 obj_01 obj_12)
(pred_3 obj_07 obj_06)
(pred_3 obj_08 obj_06)
)
)

(:constraints
  (always (not (pred_2 obj_10 obj_03)))
)
)

; plan
1. (op_1 obj_10 obj_08 obj_12 obj_02)
   deleted: (pred_3 obj_08 obj_12) (pred_4 obj_10 obj_02)
   added: (pred_1 obj_10 obj_08 obj_02)
   goals met: 1 of 3
2. (op_3 obj_05 obj_12 obj_03)
   deleted: (pred_2 obj_05 obj_12)
   added: (pred_2 obj_05 obj_03)
   goals met: 1 of 3
3. (op_3 obj_10 obj_12 obj_06)
   deleted: (pred_2 obj_10 obj_12)
   added: (pred_2 obj_10 obj_06)
   goals met: 1 of 3
4. (op_1 obj_05 obj_07 obj_03 obj_09)
   deleted: (pred_3 obj_07 obj_03) (pred_4 obj_05 obj_09)
   added: (pred_1 obj_05 obj_07 obj_09)
   goals met: 1 of 3
5. (op_3 obj_05 obj_03 obj_06)
   deleted: (pred_2 obj_05 obj_03)
   added: (pred_2 obj_05 obj_06)
   goals met: 1 of 3
6. (op_2 obj_10 obj_08 obj_06 obj_02)
   deleted: (pred_1 obj_10 obj_08 obj_02)
   added: (pred_3 obj_08 obj_06) (pred_4 obj_10 obj_02)
   goals met: 2 of 3
7. (op_2 obj_05 obj_07 obj_06 obj_09)
   deleted: (pred_1 obj_05 obj_07 obj_09)
   added: (pred_3 obj_07 obj_06) (pred_4 obj_05 obj_09)
   goals met: 3 of 3
